Tekla Open API Reference for Tekla Structures 2025
GridPlane.Father Property
Note: This API is now obsolete.
 The father grid of the grid plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Property not supported anymore. Use GridSurface.Parent instead.")]
public Grid Father { get; set; }
<ObsoleteAttribute("Property not supported anymore. Use GridSurface.Parent instead.")>
Public Property Father As Grid
	Get
	Set
Property Value
Type: Grid
See Also
Reference
GridPlane Class
Tekla.Structures.Model Namespace